In [1]:
import numpy as np
import pandas as pd

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[ 0.62930212,  0.03546385,  0.22312939],
       [ 0.96412296,  0.35023134, -0.98940019],
       [ 0.40686411, -0.14024943, -0.8839143 ],
       [-0.45484   ,  0.4418373 ,  0.57677895]])

In [7]:
dataFrame = pd.DataFrame(data)

In [10]:
dataFrame

          0         1         2
0  0.629302  0.035464  0.223129
1  0.964123  0.350231 -0.989400
2  0.406864 -0.140249 -0.883914
3 -0.454840  0.441837  0.576779

In [11]:
yeniDataFrame = pd.DataFrame(data,index = ["Atıl","Zeynep","Merve","Ceyhan"], columns = ["Maas","Yas","CalismaSaati"])

In [12]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Atıl    0.629302  0.035464      0.223129
Zeynep  0.964123  0.350231     -0.989400
Merve   0.406864 -0.140249     -0.883914
Ceyhan -0.454840  0.441837      0.576779

In [13]:
yeniDataFrame["Yas"]

Atıl      0.035464
Zeynep    0.350231
Merve    -0.140249
Ceyhan    0.441837
Name: Yas, dtype: float64

In [14]:
yeniDataFrame["CalismaSaati"]

Atıl      0.223129
Zeynep   -0.989400
Merve    -0.883914
Ceyhan    0.576779
Name: CalismaSaati, dtype: float64

In [16]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atıl    0.629302  0.035464
Zeynep  0.964123  0.350231
Merve   0.406864 -0.140249
Ceyhan -0.454840  0.441837

In [19]:
yeniDataFrame.loc["Atıl"] # Lock ile Satırları çağıralibliyoruz.

Maas            0.629302
Yas             0.035464
CalismaSaati    0.223129
Name: Atıl, dtype: float64

In [21]:
yeniDataFrame.iloc[1]

Maas            0.964123
Yas             0.350231
CalismaSaati   -0.989400
Name: Zeynep, dtype: float64

In [23]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [24]:
yeniDataFrame

            Maas       Yas  CalismaSaati  Emeklilik Yasi
Atıl    0.629302  0.035464      0.223129        0.070928
Zeynep  0.964123  0.350231     -0.989400        0.700463
Merve   0.406864 -0.140249     -0.883914       -0.280499
Ceyhan -0.454840  0.441837      0.576779        0.883675

In [25]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1)

            Maas       Yas  CalismaSaati
Atıl    0.629302  0.035464      0.223129
Zeynep  0.964123  0.350231     -0.989400
Merve   0.406864 -0.140249     -0.883914
Ceyhan -0.454840  0.441837      0.576779

In [28]:
yeniDataFrame.drop("Merve", axis = 0)

            Maas       Yas  CalismaSaati  Emeklilik Yasi
Atıl    0.629302  0.035464      0.223129        0.070928
Zeynep  0.964123  0.350231     -0.989400        0.700463
Ceyhan -0.454840  0.441837      0.576779        0.883675

In [29]:
yeniDataFrame

            Maas       Yas  CalismaSaati  Emeklilik Yasi
Atıl    0.629302  0.035464      0.223129        0.070928
Zeynep  0.964123  0.350231     -0.989400        0.700463
Merve   0.406864 -0.140249     -0.883914       -0.280499
Ceyhan -0.454840  0.441837      0.576779        0.883675

In [30]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace = True)

In [31]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Atıl    0.629302  0.035464      0.223129
Zeynep  0.964123  0.350231     -0.989400
Merve   0.406864 -0.140249     -0.883914
Ceyhan -0.454840  0.441837      0.576779

In [35]:
yeniDataFrame.loc["Atıl"]["Maas"]

0.6293021207204104

In [36]:
yeniDataFrame.loc["Zeynep","Yas"]

0.35023133591204786

In [37]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Atıl    0.629302  0.035464      0.223129
Zeynep  0.964123  0.350231     -0.989400
Merve   0.406864 -0.140249     -0.883914
Ceyhan -0.454840  0.441837      0.576779

In [39]:
boolFrame =yeniDataFrame < 0

In [40]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Atıl    0.629302  0.035464      0.223129
Zeynep  0.964123  0.350231     -0.989400
Merve   0.406864 -0.140249     -0.883914
Ceyhan -0.454840  0.441837      0.576779

In [41]:
yeniDataFrame[boolFrame]

           Maas       Yas  CalismaSaati
Atıl        NaN       NaN           NaN
Zeynep      NaN       NaN     -0.989400
Merve       NaN -0.140249     -0.883914
Ceyhan -0.45484       NaN           NaN

In [42]:
yeniDataFrame[yeniDataFrame < 0]

           Maas       Yas  CalismaSaati
Atıl        NaN       NaN           NaN
Zeynep      NaN       NaN     -0.989400
Merve       NaN -0.140249     -0.883914
Ceyhan -0.45484       NaN           NaN

In [49]:
yenibool = yeniDataFrame["CalismaSaati"] > 0

In [50]:
yeniDataFrame[yenibool]

            Maas       Yas  CalismaSaati
Atıl    0.629302  0.035464      0.223129
Ceyhan -0.454840  0.441837      0.576779

In [51]:
yeniDataFrame.reset_index()

    index      Maas       Yas  CalismaSaati
0    Atıl  0.629302  0.035464      0.223129
1  Zeynep  0.964123  0.350231     -0.989400
2   Merve  0.406864 -0.140249     -0.883914
3  Ceyhan -0.454840  0.441837      0.576779

In [52]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Atıl    0.629302  0.035464      0.223129
Zeynep  0.964123  0.350231     -0.989400
Merve   0.406864 -0.140249     -0.883914
Ceyhan -0.454840  0.441837      0.576779

In [53]:
yeniIndeksListesi = ["ati","Zey","atl","meh"]

In [54]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [55]:
yeniDataFrame

            Maas       Yas  CalismaSaati Yeni Indeks
Atıl    0.629302  0.035464      0.223129         ati
Zeynep  0.964123  0.350231     -0.989400         Zey
Merve   0.406864 -0.140249     -0.883914         atl
Ceyhan -0.454840  0.441837      0.576779         meh

In [57]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  CalismaSaati
Yeni Indeks
ati          0.629302  0.035464      0.223129
Zey          0.964123  0.350231     -0.989400
atl          0.406864 -0.140249     -0.883914
meh         -0.454840  0.441837      0.576779

In [58]:
yeniDataFrame

            Maas       Yas  CalismaSaati Yeni Indeks
Atıl    0.629302  0.035464      0.223129         ati
Zeynep  0.964123  0.350231     -0.989400         Zey
Merve   0.406864 -0.140249     -0.883914         atl
Ceyhan -0.454840  0.441837      0.576779         meh

In [59]:
yeniDataFrame.set_index("Yeni Indeks",inplace = True)

In [60]:
yeniDataFrame

                 Maas       Yas  CalismaSaati
Yeni Indeks
ati          0.629302  0.035464      0.223129
Zey          0.964123  0.350231     -0.989400
atl          0.406864 -0.140249     -0.883914
meh         -0.454840  0.441837      0.576779

In [61]:
yeniDataFrame.loc["ati"]

Maas            0.629302
Yas             0.035464
CalismaSaati    0.223129
Name: ati, dtype: float64

In [62]:
ilkIndeksler = ["Simpson","Simpson","Simpson","SouthPark","SouthPark","SouthPark"]

In [63]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [64]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [65]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('SouthPark', 'Cartman'),
 ('SouthPark', 'Kenny'),
 ('SouthPark', 'Kyle')]

In [66]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [67]:
birlesmisIndeks

MultiIndex([(  'Simpson',   'Homer'),
            (  'Simpson',    'Bart'),
            (  'Simpson',   'Marge'),
            ('SouthPark', 'Cartman'),
            ('SouthPark',   'Kenny'),
            ('SouthPark',    'Kyle')],
           )

In [71]:
benimCizgiFilmListem = [[40,"a"],[30,"b"],[10,"c"],[9,"d"],[30,"e"],[11,"f"]]

In [72]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [73]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index = birlesmisIndeks,columns = ["Yas","Meslek"])

In [74]:
cizgiFilmDataFrame

                  Yas Meslek
Simpson   Homer    40      a
          Bart     30      b
          Marge    10      c
SouthPark Cartman   9      d
          Kenny    30      e
          Kyle     11      f

In [75]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      a
Bart   30      b
Marge  10      c

In [76]:
cizgiFilmDataFrame.loc["SouthPark"]

        Yas Meslek
Cartman   9      d
Kenny    30      e
Kyle     11      f

In [79]:
cizgiFilmDataFrame.loc["SouthPark"].loc["Kenny"]

Yas       30
Meslek     e
Name: Kenny, dtype: object

In [80]:
cizgiFilmDataFrame

                  Yas Meslek
Simpson   Homer    40      a
          Bart     30      b
          Marge    10      c
SouthPark Cartman   9      d
          Kenny    30      e
          Kyle     11      f

In [81]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [82]:
cizgiFilmDataFrame

                  Yas Meslek
Film Adı  İsim
Simpson   Homer    40      a
          Bart     30      b
          Marge    10      c
SouthPark Cartman   9      d
          Kenny    30      e
          Kyle     11      f